karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
/*reg addr end*/

typedef unsigned char BYTE;

typedef BYTE KARRI_BOOL;

typedef enum {
            IDLE,
            LISTENING,
            PEER_CONNECTED,
            REQUEST_RECEIVED,
            PARSE_REQUEST,
            SEND_RESPONSE
} mainserverSM;

/*Static */

/*static const saves it in the program memory, not RAM*/

static const BYTE get_cmd[] = "GET /index.htm";

static const BYTE website_template[] =

"HTTP/1.1 404 Not Found \
Date: Sat, 10 May 2014 08:54:23 GMT \
Server: Apache/2.2.22 (Ubuntu) \
Vary: Accept-Encoding \
Content-Length: 291 \
Content-Type: text/html; charset=iso-8859-1 \
<!DOCTYPE HTML PUBLIC \"-//IETF//DTD HTML 2.0//EN\"> \
<html><head> \
<title>404 Not Found</title> \
</head><body> \
<h1>Not Found</h1> \
<p>The requested URL /index.htm was not found on this server.</p> \
<hr> \
<address>Apache/2.2.22 (Ubuntu) Server at www.karrikivela.fi Port 80</address> \
</body></html> \
";


/*Globals*/
short g_portc = 0;


int g_rx_sock0_mask;
int g_rx_sock0_base;

int g_rx_sock1_mask;
int g_rx_sock1_base;

int g_tx_sock0_mask;
int g_tx_sock0_base;

int g_tx_sock1_mask;
int g_tx_sock1_base;

int g_mainSM_state = IDLE;

/*Macros for turning LEDs on*/
#define LED1_ON() \
  do { \
    g_portc |= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_ON() \
  do { \
    g_portc |= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_ON() \
  do { \
    g_portc |= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_ON() \
  do { \
    g_portc |= 0x08; \
    PORTC = g_portc;\
  } while (0)

/*Macros for turning LEDs off*/
#define LED1_OFF() \
  do { \
    g_portc &= 0xFE; \
    PORTC = g_portc;\
  } while (0)

#define LED2_OFF() \
  do { \
    g_portc &= 0xFD; \
    PORTC = g_portc;\
  } while (0)

#define LED3_OFF() \
  do { \
    g_portc &= 0xFB; \
    PORTC = g_portc;\
  } while (0)

#define LED4_OFF() \
  do { \
    g_portc &= 0xF7; \
    PORTC = g_portc;\
  } while (0)

#define RESET_LOW() \
  do { \
    PORTCbits.RC4 = 0; \
  } while (0)

#define RESET_HIGH() \
  do { \
    g_portc = PORTC;\
    g_portc |= BIT4;\
    PORTC = g_portc;\
  } while (0)


/*SPI macros*/
#if 1
#define CS_ASSERT() \
  do { \
    PORTCbits.RC6 = 0; \
  } while (0)

#define CS_DEASSERT() \
  do { \
    PORTCbits.RC6 = 1; \
  } while (0)
#else
#define CS_ASSERT() \
  do { \
    g_portc = PORTC; \
    g_portc &= 0x40; \
    PORTC = g_portc;\
  } while (0)

#define CS_DEASSERT() \
  do { \
    g_portc = PORTC; \
    g_portc |= 0xBF; \
    PORTC = g_portc;\
  } while (0)
#endif

#define DELAY_BETWEEN_COMMANDS() delay(5000)

#define SPI_SYNC_TX_BYTE(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
    } while(0)

#ifdef READ_OLD_IMPLEMENATION
#define WIZNET_WRITE(addrh, addrl, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE(addrh);\
        SPI_SYNC_TX_BYTE(addrl);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)
#else
#define WIZNET_WRITE(addr, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);\
        SPI_SYNC_TX_BYTE(addr & 0x00FF);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)
#endif

#ifdef READ_OLD_IMPLEMENATION
inline unsigned char
wiznet_read(unsigned char addrh,
            unsigned char addrl)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(0x0F);
    SPI_SYNC_TX_BYTE(addrh);
    SPI_SYNC_TX_BYTE(addrl);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}
#else
inline unsigned char
wiznet_read(unsigned int addr)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(READ_OPCODE);
    SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);
    SPI_SYNC_TX_BYTE(addr & 0x00FF);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}
#endif

#if 0
#define SPI_SYNC_TX_BYTE_FOR_RX(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
    } while(0)
#endif
#if 0 //implement later
/* Sending dummy data (0xFF) while receiving, to get clock out */
#define SPI_SYNC_RX_BYTE(&rx_byte) \
    do { \
        SSPBUF = 0xFF; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
        *rx_byte = SSPBUF; \
    } while(0)
#endif

#ifdef SPI_SLAVE_BUSPIRATE_TEST
inline short POLL_SS()
{
    short ss_state = 0;
    g_portc = PORTC;
    ss_state = g_portc && 0x40;
    return ss_state;
}
#endif
/**/

inline KARRI_BOOL compare_buffers(BYTE *eth_buff, BYTE *cmd, unsigned int size)
{
    KARRI_BOOL ret_status = KARRI_OK;
    int x;
    for(x=0;x<size;x++)
    {
        if(eth_buff[x] != cmd[x])
        {
            ret_status = KARRI_NOK;
            break;
        }
    }

    return ret_status;
}


typedef unsigned char DEBUG_MSG;
#ifdef UART_DEBUG
inline void debug_print(DEBUG_MSG *msg)
{
    int x;
#if 1
    for(x=0;x<MAX_UART_PRINT_LENGTH;x++)
    {
        if(msg[x] == '\n') //break character
        {
            break;
        }

        while(!TXSTAbits.TRMT);

        TXREG = msg[x];
    }

    while(!TXSTAbits.TRMT);
    TXREG = 0x0A;
    while(!TXSTAbits.TRMT);
    TXREG = 0x0D;
#endif
#if 0
    for(x=0;x<10;x++)
    {
        TXREG = 0x31 + x;
        while(!TXSTAbits.TRMT);
    }
#endif
}
#else
inline void debug_print(DEBUG_MSG *msg)
{
    _nop();
}
#endif //UART_DEBUG


/*Configuration bits*/
#pragma config CPD      = OFF
#pragma config BOREN    = ON
#pragma config IESO     = OFF
#pragma config FOSC     = HS //No need to consider power consumption
#pragma config FCMEN    = ON
#pragma config MCLRE    = ON //need to check
#pragma config WDTE     = OFF
#pragma config CP       = OFF
#pragma config PWRTE    = ON
/**/

/********************************************/
/*Implementations*/


void delay(unsigned int count)
{
    unsigned int x;
    for(x=0;x<count;x++)
    {
        _nop();
    }
}

void wiznet_read_bytes(unsigned int chip_addr, BYTE *rx_buff, unsigned int len)
{
    int x;
    for(x=0;x<len;x++)
    {
#ifdef READ_OLD_IMPLEMENATION
        rx_buff[x] = wiznet_read((unsigned char)(chip_addr & 0xFF00),(unsigned char)(chip_addr & 0x00FF));
#else
        rx_buff[x] = wiznet_read(chip_addr);
#endif
        chip_addr++;
    }
}


void wiznet_write_bytes(unsigned int chip_addr, BYTE *tx_buff, unsigned int len)
{
    int x;
    for(x=0;x<len;x++)
    {
        //WIZNET_WRITE((unsigned char)(chip_addr & 0xFF00),(unsigned char)(chip_addr & 0x00FF),tx_buff[x]);
        WIZNET_WRITE(chip_addr, tx_buff[x]);

