karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
        chip_addr++;
    }
}


// SDI - RB4
// SDO - RC7
// SCL - RB6
// SS  - RC6
/*Write & read test byte*/
short test_wiznet_connection(void)
{
    short conn_status = KARRI_NOK;
    unsigned char rxByte = 0;

    //debug_print("test_wiznet_connection++\n");

    //We use here register REG_GATEWAY_IP3 for testing write & read of the CHIP
    WIZNET_WRITE(0x0004, TEST_BYTE);

    rxByte = wiznet_read(0x0004);

    WIZNET_WRITE(0x0004, 0x00);

    if(rxByte == TEST_BYTE)
    {
        conn_status = KARRI_OK;
    }
    else
    {
        conn_status = KARRI_NOK;
    }

    //debug_print("test_wiznet_connection--\n");
    return conn_status;
}


/*
 *
 * Basic Setting
For the W5100 operation, select and utilize appropriate registers shown below.
1. Mode Register (MR)
2. Interrupt Mask Register (IMR)
3. Retry Time-value Register (RTR)
4. Retry Count Register (RCR)
For more information of above registers, refer to the ?Register Descriptions?.
 *
 *
 * Setting network information
Below register is for basic network configuration information to be configured according to
the network environment.
1. Gateway Address Register (GAR)
2. Source Hardware Address Register (SHAR)
3. Subnet Mask Register (SUBR)
4. Source IP Address Register (SIPR)
The Source Hardware Address Register (SHAR) is the H/W address to be used in MAC layer, and
can be used with the address that manufacturer has been assigned. The MAC address can be
assigned from IEEE. For more detail, refer to IEEE homepage.
 *
 *
 * Set socket memory information
This stage sets the socket tx/rx memory information. The base address and mask address of
each socket are fixed and saved in this stage.
 *
 Example (abstract):
 {
 RMSR = 0x55; // assign 2K rx memory per socket.
gS0_RX_BASE = chip_base_address + RX_memory_base_address(0x6000);
gS0_RX_MASK = 2K ? 1 ; // 0x07FF, for getting offset address within assigned socket 0 RX
memory.
gS1_RX_BASE = gS0_BASE + (gS0_MASK + 1);
gS1_RX_MASK = 2K ? 1 ;
gS2_RX_BASE = gS1_BASE + (gS1_MASK + 1);
gS2_RX_MASK = 2K ? 1 ;
gS3_RX_BASE = gS2_BASE + (gS2_MASK + 1);
gS3_RX_MASK = 2K ? 1 ;
TMSR = 0x55; // assign 2K tx memory per socket.
Same method, set gS0_TX_BASE, gS0_TX_MASK, gS1_TX_BASE, gS1_TX_MASK,
gS2_TX_BASE, gS2_TX_MASK, gS3_TX_BASE and gS3_TX_MASK.
 }
 *
 *
 *
 */
void init_wiznet(void)
{
    /**GENERAL NETWORK STACK CONFIGURATION**/
    //Set IMR -  all interrupts as masked 
    WIZNET_WRITE(REG_INTERRUPT_MASK,0x00);
    DELAY_BETWEEN_COMMANDS();

    //RTR default (200ms) no need to change currently
    //RCR default (8) no need to change currently

    /**IP LEVEL CONFIGURATION**/
    //No space/time for DHCP server code, setting options currently as fixed!
    //GWR register - gateway IP address 10.0.0.138
    WIZNET_WRITE(REG_GATEWAY_IP0,0x0A); //10
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP1,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP2,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_GATEWAY_IP3,0x8A); //.138
    DELAY_BETWEEN_COMMANDS();

    //SUBR register - subnet mask 255.255.255.0
    WIZNET_WRITE(REG_SUBNET_MASK_IP0,0xFF); //255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP1,0xFF); //.255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP2,0xFF); //.255
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SUBNET_MASK_IP3,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    //SAHR register - MAC address CA:CA:CA:FE:BA:BE
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC0,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC1,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC2,0xCA); //CA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC3,0xFE); //FE
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC4,0xBA); //BA
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_MAC5,0xBE); //BE
    DELAY_BETWEEN_COMMANDS();
    //SIPR register - device IP address 10.0.0.77
    WIZNET_WRITE(REG_SOURCE_ADDR_IP0,0x0A); //10
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP1,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP2,0x00); //.0
    DELAY_BETWEEN_COMMANDS();
    WIZNET_WRITE(REG_SOURCE_ADDR_IP3,0x4D); //.77
    DELAY_BETWEEN_COMMANDS();

    /**SOCKET BUFFER CONFIGURATION**/
    //Setting up the 8K memory for 2 sockets, 4k per socket. Only using 1 socket but why not set up two if by some chance we'd need a second one :)
    //RMSR register - setting 4K to sockets 0 & 1
    WIZNET_WRITE(REG_RX_MEM_SIZE,0x0A);
    DELAY_BETWEEN_COMMANDS();
    //TMSR register - setting 4K to sockets 0 & 1
    WIZNET_WRITE(REG_TX_MEM_SIZE,0x0A);
    DELAY_BETWEEN_COMMANDS();

    g_rx_sock0_base = CHIP_BASE_ADDRESS + RX_MEMORY_BASE_ADDRESS;
    g_rx_sock0_mask = 0x0FFF;

    g_rx_sock1_base = g_rx_sock0_base + (g_rx_sock0_mask + 1);
    g_rx_sock1_mask = 0x0FFF;

    g_tx_sock0_base = CHIP_BASE_ADDRESS + TX_MEMORY_BASE_ADDRESS;
    g_tx_sock0_mask = 0x0FFF;

    g_tx_sock1_base = g_tx_sock0_base + (g_tx_sock0_mask + 1);
    g_tx_sock1_mask = 0x0FFF;

    
}


void dev_init(void)
{
    /*Clock*/
    OSCCON = 0x08; //clock from fOSC

    //Use all those MOTHER FUCKERS as DIGITAL-FUCKING-INPUT!!!
    ANSEL = 0;
    ANSELH = 0;

    /*LEDS I/O*/
    //Set RC0 (LED1) to output
    TRISCbits.TRISC0 = 0;
    //Set RC1 (LED2) to output
    TRISCbits.TRISC1 = 0;
    //Set RC2 (LED3) to output
    TRISCbits.TRISC2 = 0;
    //Set RC3 (LED4) to output
    TRISCbits.TRISC3 = 0;
    //All output to zero
    PORTC = 0;

#ifdef KARRI_DEBUG
    TRISCbits.TRISC4 = 0; //debug pin output
#endif
    
    /*SPI init*/

    //Set RC6 (SS) to output
    TRISCbits.TRISC6 = 0;

    //Set RC7 (SDO) to output
    TRISCbits.TRISC7 = 0;
    //Set RB6 (SCL) to output
    TRISBbits.TRISB6 = 0;
    //Set RB4 (SDI) to input
    TRISBbits.TRISB4 = 1;

    //Disable the pull up resistors for all the PORTB pins 4-7
    WPUB = 0;
    //Disable the itnerrupt on change for all the PORTB pins 4-7
    IOCB = 0;
    
    //SPI idle low (CKP = 0), Data transmitted on rising edge (CKE = 1)
    SSPSTAT = /*0xC0;*/ 0x40;
    SSPCON = 0x21; //SCL fOSC/16 == 250kHz

