karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
            case REQUEST_RECEIVED:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case REQUEST_RECEIVED\n");
#endif

                sprintf( int_string, "RX size: %d\n", rx_data_size );

                debug_print(int_string);


#ifdef EXTENDED_FUNCTIONALITY
                //Get the read pointer to received data of socket 0
                spi_rx_byte = wiznet_read(0x04,0x28);
                rx_sock1_read_pointer = (spi_rx_byte << 8);
                spi_rx_byte = wiznet_read(0x04,0x29);
                rx_sock1_read_pointer |= spi_rx_byte;

                rx_data_offset = rx_sock1_read_pointer & g_rx_sock0_mask;
                rx_data_start_addr = g_rx_sock0_base + rx_data_offset;

                if((rx_data_size + rx_data_offset) > (g_rx_sock0_mask + 1))
                {//buffer wrap-around occured
                    unsigned int left_size = 0;
                    rx_upper_size = (g_rx_sock0_mask + 1) - rx_data_offset;

                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_upper_size);

                    left_size = rx_data_size - rx_upper_size;

                    wiznet_read_bytes(g_rx_sock0_base, eth_buff+rx_upper_size, left_size);
                }
                else
                {
                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_data_size);
                }

                //Update RX buff pointer & send command for RECV done
                rx_sock1_read_pointer += rx_data_size;
                WIZNET_WRITE(0x0428,(rx_sock1_read_pointer & 0xFF00));
                WIZNET_WRITE(0x0429,(rx_sock1_read_pointer & 0x00FF));
                WIZNET_WRITE(0x0403,RECV);
#endif
                g_mainSM_state = PARSE_REQUEST;
                break;

            case PARSE_REQUEST:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case PARSE_REQUEST\n");
#endif
#ifdef EXTENDED_FUNCTIONALITY
                parse_status = compare_buffers(eth_buff, get_cmd, sizeof(get_cmd));

                if(parse_status == KARRI_OK)
                {
                    g_mainSM_state = SEND_RESPONSE;
                }
                else
                {
                    g_mainSM_state = PEER_CONNECTED;
                }
#else
                g_mainSM_state = SEND_RESPONSE;
#endif


                break;

            case SEND_RESPONSE://send the web site as a response
#ifdef KARRI_DEBUG
                debug_print("mainSM: case SEND_RESPONSE\n");
#endif
#if 1 //send functionality

                //wait for TX reg size availability
                do {
                    tx_getsize_timeout_counter++;
                    delay(600);
                    //Get the size of TX socket 0
                    spi_rx_byte = wiznet_read(0x0420);
                    tx_data_size = (unsigned int)(spi_rx_byte << 8);
                    spi_rx_byte = wiznet_read(0x0421);
                    tx_data_size |= spi_rx_byte;

                    if(TX_GETSIZE_TIMEOUT_THRESHOLD < tx_getsize_timeout_counter)
                    {
                        WIZNET_WRITE(0x0403,CLOSE);
                        g_mainSM_state = IDLE;
                        break;
                    }
                } while(tx_data_size < sizeof(website_template));



                //Get the write pointer
                spi_rx_byte = wiznet_read(0x0424);
                tx_sock1_read_pointer = (unsigned int)(spi_rx_byte << 8);
                spi_rx_byte = wiznet_read(0x0425);
                tx_sock1_read_pointer |= spi_rx_byte;

                tx_data_offset = tx_sock1_read_pointer & g_rx_sock0_mask;
                tx_data_start_addr = g_rx_sock0_base + tx_data_offset;


                //wiznet_write_bytes(tx_data_start_addr, website_template, sizeof(website_template));
                //move pointer and set over SPI to CHIP
#else
                debug_print("SEND_RESPONSE: no implementation, closing socket going back to idle\n");
                //This prepares for a reset!
                WIZNET_WRITE(0x0403,CLOSE);
                g_mainSM_state = IDLE;//0xFF; //reset PIC
#endif
                break;
                
            default:/**ENDING UP HERE CAUSES A SOFTWARE RESET!**/
#ifdef KARRI_DEBUG
                debug_print("WARNING!! Doing a soft *RESET* to PIC soon!\n");
#endif

#ifdef KARRI_DEBUG
                WIZNET_WRITE(REG_MODE,MRREG_SOFT_RESET);

                BYTE blink_count;
                for(blink_count=0;blink_count<5;blink_count++)
                {
                    LED1_ON();
                    LED2_ON();
                    LED3_ON();
                    LED4_ON();
                    delay(5000);
                    LED1_OFF();
                    LED2_OFF();
                    LED3_OFF();
                    LED4_OFF();
                    delay(5000);//Delay for reset to happen on CHIP before PIC reset
                }
#endif //KARRI_DEBUG

                WDTCONbits.SWDTEN = 1; //Enable watchdog timer! Let it reset the damn thing!
#ifdef KARRI_DEBUG
                debug_print("Watchdog starts kicking, we shall RESET immediately!\n");
#endif
                //RESET
                break;
        }

        DELAY_BETWEEN_COMMANDS();
        DELAY_BETWEEN_COMMANDS();
    }
#endif //karri comment out the rest of the app
#ifdef KARRI_DEBUG
    //Indicate firmware finished
    LED4_ON();

    debug_print("FW end, looping forever\n");
    while(1);
#endif //KARRI_DEBUG

    return 0;
}

#if 0
short setLed(short state, short ledNum)
{
    short ret = KARRI_NOK;
    short tempReg = 0;

    /*Sanity check, as we write the value straight to the HW register*/
    if(state > 1 || state < 0)
    {
        return KARRI_NOK;
    }

    switch(ledNum)
    {
        //tempReg = PORTC;
        //tempReg = tempReg | state;
        case 1:
            g_portc ^= (state << (ledNum-1));
            PORTC = g_portc;
            ret = KARRI_OK;
            break;
        case 2:
            g_portc ^= (state << (ledNum-1));
            PORTC = g_portc;
            ret = KARRI_OK;
            break;
        case 3:
            g_portc ^= (state << (ledNum-1));
            PORTC = g_portc;
            ret = KARRI_OK;
            break;
        case 4:
            g_portc ^= (state << (ledNum-1));
            PORTC = g_portc;
            ret = KARRI_OK;
            break;
        default:
            ret = KARRI_NOK;
    }

    return ret;
}
#endif //if 0

#if 0
    /*Write test byte*/
    CS_ASSERT();
    //debug_print("CS asserted\n");
    SSPBUF = 0xF0;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    //debug_print("byte 1 sent\n");
    SSPBUF = 0x00;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    //debug_print("byte 2 sent\n");
    SSPBUF = 0x04;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    //debug_print("byte 3 sent\n");
    SSPBUF = TEST_BYTE;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    //debug_print("byte 4 sent\n");
    CS_DEASSERT();
    //debug_print("CS deasserted\n");

    CS_ASSERT();
    _nop();
    CS_DEASSERT();

    /*Read test byte*/
    CS_ASSERT();
    //debug_print("CS asserted\n");
    SSPBUF = 0x0F;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    SSPBUF = 0x00;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    SSPBUF = 0x04;
    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;
    //debug_print("bytes 1-3 sent, reading\n");
    SSPBUF = 0xFF; //dummy data for sending while receiving the byte

    while(!PIR1bits.SSPIF);
    PIR1bits.SSPIF = 0;

    rxByte = SSPBUF;
    //debug_print(("We read a byte\n"));
    CS_DEASSERT();
    //debug_print("CS deasserted\n");
#endif
